wrk+async/put-lock.log
$ ./wrk2/wrk -t4 -c4 -d120s -R10000 -s put.lua --latency http://localhost:8080
Running 2m test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 1.064ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.053ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.034ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.044ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.03ms  528.40us  16.34ms   62.78%
    Req/Sec     2.63k   201.14     6.78k    74.84%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.02ms
 75.000%    1.41ms
 90.000%    1.74ms
 99.000%    1.94ms
 99.900%    2.98ms
 99.990%   10.31ms
 99.999%   14.63ms
100.000%   16.34ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.077     0.000000            1         1.00
       0.308     0.100000       110316         1.11
       0.525     0.200000       220131         1.25
       0.741     0.300000       330476         1.43
       0.913     0.400000       440244         1.67
       1.023     0.500000       550536         2.00
       1.076     0.550000       605536         2.22
       1.131     0.600000       660557         2.50
       1.201     0.650000       715237         2.86
       1.306     0.700000       770246         3.33
       1.415     0.750000       825373         4.00
       1.471     0.775000       852858         4.44
       1.524     0.800000       880169         5.00
       1.577     0.825000       907828         5.71
       1.631     0.850000       935137         6.67
       1.683     0.875000       962789         8.00
       1.710     0.887500       976275         8.89
       1.739     0.900000       990367        10.00
       1.767     0.912500      1003721        11.43
       1.795     0.925000      1017631        13.33
       1.821     0.937500      1031356        16.00
       1.834     0.943750      1038168        17.78
       1.847     0.950000      1045059        20.00
       1.860     0.956250      1051938        22.86
       1.873     0.962500      1059016        26.67
       1.886     0.968750      1065868        32.00
       1.893     0.971875      1069283        35.56
       1.900     0.975000      1072681        40.00
       1.907     0.978125      1076302        45.71
       1.914     0.981250      1079689        53.33
       1.921     0.984375      1083085        64.00
       1.924     0.985938      1084475        71.11
       1.928     0.987500      1086232        80.00
       1.933     0.989062      1088107        91.43
       1.938     0.990625      1089849       106.67
       1.943     0.992188      1091376       128.00
       1.947     0.992969      1092341       142.22
       1.951     0.993750      1093173       160.00
       1.956     0.994531      1094067       182.86
       1.961     0.995313      1094838       213.33
       1.969     0.996094      1095650       256.00
       1.975     0.996484      1096085       284.44
       1.981     0.996875      1096508       320.00
       1.990     0.997266      1096938       365.71
       2.005     0.997656      1097372       426.67
       2.038     0.998047      1097803       512.00
       2.099     0.998242      1098015       568.89
       2.229     0.998437      1098228       640.00
       2.411     0.998633      1098439       731.43
       2.667     0.998828      1098654       853.33
       3.041     0.999023      1098868      1024.00
       3.255     0.999121      1098976      1137.78
       3.507     0.999219      1099083      1280.00
       3.793     0.999316      1099192      1462.86
       4.107     0.999414      1099298      1706.67
       4.463     0.999512      1099405      2048.00
       4.695     0.999561      1099461      2275.56
       4.931     0.999609      1099513      2560.00
       5.219     0.999658      1099568      2925.71
       5.567     0.999707      1099622      3413.33
       6.095     0.999756      1099674      4096.00
       6.531     0.999780      1099701      4551.11
       7.127     0.999805      1099728      5120.00
       7.767     0.999829      1099755      5851.43
       8.559     0.999854      1099781      6826.67
       9.471     0.999878      1099808      8192.00
       9.975     0.999890      1099822      9102.22
      10.447     0.999902      1099835     10240.00
      10.879     0.999915      1099849     11702.86
      11.343     0.999927      1099862     13653.33
      11.799     0.999939      1099875     16384.00
      12.079     0.999945      1099882     18204.44
      12.319     0.999951      1099889     20480.00
      12.591     0.999957      1099896     23405.71
      12.871     0.999963      1099902     27306.67
      13.175     0.999969      1099909     32768.00
      13.351     0.999973      1099912     36408.89
      13.527     0.999976      1099917     40960.00
      13.743     0.999979      1099919     46811.43
      13.807     0.999982      1099922     54613.33
      14.071     0.999985      1099926     65536.00
      14.207     0.999986      1099927     72817.78
      14.351     0.999988      1099929     81920.00
      14.631     0.999989      1099931     93622.86
      14.759     0.999991      1099932    109226.67
      15.031     0.999992      1099934    131072.00
      15.239     0.999993      1099935    145635.56
      15.303     0.999994      1099936    163840.00
      15.527     0.999995      1099937    187245.71
      15.527     0.999995      1099937    218453.33
      15.575     0.999996      1099938    262144.00
      15.799     0.999997      1099939    291271.11
      15.799     0.999997      1099939    327680.00
      15.831     0.999997      1099940    374491.43
      15.831     0.999998      1099940    436906.67
      15.831     0.999998      1099940    524288.00
      16.103     0.999998      1099941    582542.22
      16.103     0.999998      1099941    655360.00
      16.103     0.999999      1099941    748982.86
      16.103     0.999999      1099941    873813.33
      16.103     0.999999      1099941   1048576.00
      16.343     0.999999      1099942   1165084.44
      16.343     1.000000      1099942          inf
#[Mean    =        1.027, StdDeviation   =        0.528]
#[Max     =       16.336, Total count    =      1099942]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1199984 requests in 2.00m, 76.67MB read
Requests/sec:   9999.90
Transfer/sec:    654.29KB